Repository: authoress/sphinx-intl-demo
Catalog: zen/locale/*/LC_MESSAGES/index.po
Languages: pt_br, ru

source: The Zen of Python
pt_br: O Zen de Python
ru: Дзен Питона

source: *By Tim Peters*
pt_br: *Por Tim Peters*
ru: *От Тима Петерса*

source: Beautiful is better than ugly.
pt_br: Bonito e melhor que feio.
ru: Красивое лучше уродливого.

source: Explicit is better than implicit.
pt_br: Explicito e melhor que implicito.
ru: Явное лучше неявного.

source: Simple is better than complex.
pt_br: Simples e melhor que complexo.
ru: Простое лучше сложного.

source: Complex is better than complicated.
pt_br: Complexo e melhor que complicado.
ru: Сложное лучше мудреного.

source: Flat is better than nested.
pt_br: Plano e melhor que aglomerado.
ru: Плоское лучше вложенного.

source: Sparse is better than dense.
pt_br: Esparso e melhor que denso.
ru: Разреженное лучше плотного.

source: Readability counts.
pt_br: Legibilidade faz diferenca.
ru: Читаемость имеет значение.

source: Special cases aren't special enough to break the rules.
pt_br: Casos especiais nao sao especiais o bastante para quebrar as regras.
ru: Особые случаи не настолько особы, чтобы нарушать правила.

source: Although practicality beats purity.
pt_br: Embora a praticidade venca a pureza.
ru: Хотя практичность лучше безупречности.

source: Errors should never pass silently.
pt_br: Erros nunca devem passar silenciosamente.
ru: Ошибки не должны проходить незамеченными.

source: Unless explicitly silenced.
pt_br: A menos que sejam explicitamente silenciados.
ru: Если только не игнорируются намеренно.

source: In the face of ambiguity, refuse the temptation to guess.
pt_br: Diante da ambiguidade, recuse a tentacao de adivinhar.
ru: Наткнувшись на двусмысленность, откажись от соблазна угадать.

source: There should be one-- and preferably only one --obvious way to do it.
pt_br: Deve haver um -- e preferencialmente so um -- modo obvio para fazer algo.
ru: Должен быть один (и лучше единственный) очевидный способ сделать что-то.

source: Although that way may not be obvious at first unless you're Dutch.
pt_br: Embora esse modo possa nao ser obvio a primeira vista a menos que voce seja holandes.
ru: Хотя поначалу этот способ может быть неочевиден, если только ты не голландец.

source: Now is better than never.
pt_br: Agora e melhor que nunca.
ru: Сейчас лучше, чем никогда.

source: Although never is often better than \*right\* now.
pt_br: Embora nunca frequentemente seja melhor que \*exatamente\* agora.
ru: Хотя никогда обычно лучше, чем \*прямо\* сейчас.

source: If the implementation is hard to explain, it's a bad idea.
pt_br: Se a implementacao e dificil de explicar, e uma ma ideia.
ru: Если реализацию трудно объяснить, то идея плоха.

source: If the implementation is easy to explain, it may be a good idea.
pt_br: Se a implementacao e facil de explicar, pode ser uma boa ideia.
ru: Если реализацию легко объяснить, то идея, возможно, хороша.

source: Namespaces are one honking great idea -- let's do more of those!
pt_br: Namespaces sao uma grande ideia -- vamos fazer mais dessas!
ru: Пространства имен -- это отличная идея, давайте пользоваться ею чаще!

source: Translation info
pt_br: (Origem da tradução: `PythonBrasil <https://wiki.python.org.br/TheZenOfPython>`_)
ru: (Переведено authoress)
